thangtk21/STM32-Projects/Ignition Coil/Rev2/Get_Data/Receive_303rct6/Src/main.c

/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2019 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f3xx_hal.h"

/* USER CODE BEGIN Includes */
#include "variable.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
CAN_HandleTypeDef hcan;

I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CAN_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C2_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
static void CAN_FilterConfig(void);
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
	
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */
	hcan.pTxMsg = &CanTx;
	hcan.pTxMsg->RTR = CAN_RTR_DATA;
	hcan.pTxMsg->IDE = CAN_ID_STD;
  hcan.pRxMsg = &CanRx;
	
  CAN_FilterConfig();
  if (HAL_CAN_Receive_IT(&hcan, CAN_FIFO0) != HAL_OK)
  {
    Error_Handler();
  }
  HAL_NVIC_DisableIRQ(in1_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in1_rising_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in2_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in2_rising_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in3_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in3_rising_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in4_falling_EXTI_IRQn);
  HAL_NVIC_DisableIRQ(in4_rising_EXTI_IRQn);
	
	//Get Parameter from EEPROM
	HAL_I2C_Mem_Read(&hi2c2,address_24LC08,0x00,1,buffer_read1,8,100);
	HAL_Delay(10);
	n1_pa = buffer_read1[0];
	n2_pa = buffer_read1[1];
	B_H = buffer_read1[2];
	B_L = buffer_read1[3];
	C_H = buffer_read1[4];
	C_L = buffer_read1[5];
	D_H = buffer_read1[6];
	D_L = buffer_read1[7];
	
	HAL_I2C_Mem_Read(&hi2c2,address_24LC08,0x20,1,buffer_read2,8,100);
	HAL_Delay(10);
	n1_pb = buffer_read2[0];
	n2_pb = buffer_read2[1];
	B1_H = buffer_read2[2];
	B1_L = buffer_read2[3];
	C1_H = buffer_read2[4];
	C1_L = buffer_read2[5];
	B2_H = buffer_read2[6];
	B2_L = buffer_read2[7];
	
	HAL_I2C_Mem_Read(&hi2c2,address_24LC08,0x40,1,buffer_read3,5,100);
	HAL_Delay(10);
	D1_H = buffer_read3[0];
	D1_L = buffer_read3[1];
	E_HH = buffer_read3[2];
	E_H = buffer_read3[3];
	E_L = buffer_read3[4];
	
	HAL_I2C_Mem_Read(&hi2c2,address_24LC08,0x60,1,buffer_read4,5,100);
	HAL_Delay(10);
	D2_H = buffer_read4[0];
	D2_L = buffer_read4[1];
	C2_H = buffer_read4[2];
	C2_L = buffer_read4[3];
	
	B = (B_H << 8) | B_L;
	C = (C_H << 8) | C_L;
	D = (D_H << 8) | D_L;

	B1 = (B1_H << 8) | B1_L;
	C1 = (C1_H << 8) | C1_L;
	B2 = (B2_H << 8) | B2_L;

	D1 = (D1_H << 8) | D1_L;
	E = (E_HH << 16) | (E_H << 8) | E_L;

	D2 = (D2_H << 8) | D2_L;
	C2 = (C2_H << 8) | C2_L;
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
		//---------------------------------------------------------------------------------Neu ben truyen nhan send_data

		////---------------------------------------------------------------------------------pattern a
    if (can_rx_int1 == 1)
    {
			can_rx_int1 = 0;
			
      __HAL_GPIO_EXTI_CLEAR_IT(in1_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in1_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in2_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in2_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in3_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in3_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in4_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in4_rising_Pin);

      HAL_NVIC_EnableIRQ(in1_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in1_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in2_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in2_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in3_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in3_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in4_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in4_rising_EXTI_IRQn);

