thangtk21/STM32-Projects/Ignition Coil/Rev2/Get_Data/Receive_303rct6/Src/main.c
      B = (B_H << 8) | B_L;
      C = (C_H << 8) | C_L;
      D = (D_H << 8) | D_L;
			
			
			buffer_write1[0] = n1_pa;
			buffer_write1[1] = n2_pa;
			buffer_write1[2] = B_H;
			buffer_write1[3] = B_L;
			buffer_write1[4] = C_H;
			buffer_write1[5] = C_L;
			buffer_write1[6] = D_H;
			buffer_write1[7] = D_L;
			HAL_I2C_Mem_Write(&hi2c2,address_24LC08,0x00,1,buffer_write1,8,100);
			HAL_Delay(10);
			
			
			
			if(D >= 20)	D = D - 10;
			if(D < 10) D = 10;
			
				
			
			
			if(D == 0 && n1_pa == 0 && n2_pa == 0)
			{
				HAL_TIM_Base_Stop_IT(&htim1);
				HAL_TIM_Base_Stop_IT(&htim2);
			}
			else
			{
			//Generate Pulse
				HAL_TIM_Base_Start_IT(&htim1);
				HAL_TIM_Base_Stop_IT(&htim2);
			}
			
    }
		
		////---------------------------------------------------------------------------------pattern b    
    if (can_rx_int2 == 1 && can_rx_int3 == 1 && can_rx_int4 == 1)
    {
			can_rx_int2 = 0;
      can_rx_int3 = 0;
      can_rx_int4 = 0;
			
      __HAL_GPIO_EXTI_CLEAR_IT(in1_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in1_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in2_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in2_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in3_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in3_rising_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in4_falling_Pin);
      __HAL_GPIO_EXTI_CLEAR_IT(in4_rising_Pin);

      HAL_NVIC_EnableIRQ(in1_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in1_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in2_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in2_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in3_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in3_rising_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in4_falling_EXTI_IRQn);
      HAL_NVIC_EnableIRQ(in4_rising_EXTI_IRQn);
			
      B1 = (B1_H << 8) | B1_L;
      C1 = (C1_H << 8) | C1_L;
      B2 = (B2_H << 8) | B2_L;
      D1 = (D1_H << 8) | D1_L;
      E = (E_HH << 16) | (E_H << 8) | E_L;
      D2 = (D2_H << 8) | D2_L;
      C2 = (C2_H << 8) | C2_L;
			
			//write byte to EEPROM
			buffer_write2[0] = n1_pb;
			buffer_write2[1] = n2_pb;
			buffer_write2[2] = B1_H;
			buffer_write2[3] = B1_L;
			buffer_write2[4] = C1_H;
			buffer_write2[5] = C1_L;
			buffer_write2[6] = B2_H;
			buffer_write2[7] = B2_L;
			HAL_I2C_Mem_Write(&hi2c2,address_24LC08,0x20,1,buffer_write2,8,100);
			HAL_Delay(10);
			
			buffer_write3[0] = D1_H;
			buffer_write3[1] = D1_L;
			buffer_write3[2] = E_HH;
			buffer_write3[3] = E_H;
			buffer_write3[4] = E_L;
			HAL_I2C_Mem_Write(&hi2c2,address_24LC08,0x40,1,buffer_write3,5,100);
			HAL_Delay(10);
			
			buffer_write4[0] = D2_H;
			buffer_write4[1] = D2_L;
			buffer_write4[2] = C2_H;
			buffer_write4[3] = C2_L;
			HAL_I2C_Mem_Write(&hi2c2,address_24LC08,0x60,1,buffer_write4,5,100);
			HAL_Delay(10);
   
			//Calibration
			if(D1 >= 10)	D1 = D1 - 10;
			if(B1 >= 20) B1 = B1 - 10;
			
			if(n1_pb == 0) C1 = 0;
			if(C1 == 0) n1_pb = 0;
			if(n2_pb == 0) C2 = 0;
			if(C2 == 0) n2_pb = 0;
			if(n1_pb == 0 && n2_pb == 0 && B1 == 0 && C1 == 0 && D1 == 0 && E == 0 && D2 == 0 && C2 == 0)	D1 = 100;
			
			
			
			//Generate Pulse
			HAL_TIM_Base_Start_IT(&htim2);
			HAL_TIM_Base_Stop_IT(&htim1);
			
    }
		
		////---------------------------------------------------------------------------------Neu ben truyen an request data
		if(flag_request_data == 1)
		{
			flag_request_data = 0;
			
			if(flag_choose_mode == pattern_a)
			{
				CanTx.StdId = 0x201;
				CanTx.DLC = 8;
				CanTx.Data[0] = n1_pa;
				CanTx.Data[1] = n2_pa;
				CanTx.Data[2] = B_H;
				CanTx.Data[3] = B_L;
				CanTx.Data[4] = C_H;
				CanTx.Data[5] = C_L;
				CanTx.Data[6] = D_H;
				CanTx.Data[7] = D_L;
				HAL_CAN_Transmit(&hcan, 10);
				HAL_Delay(10);
			}
			
			if(flag_choose_mode == pattern_b)
			{
				CanTx.StdId = 0x202;
				CanTx.DLC = 8;
				CanTx.Data[0] = n1_pb;
				CanTx.Data[1] = n2_pb;
				CanTx.Data[2] = B1_H;
				CanTx.Data[3] = B1_L;
				CanTx.Data[4] = C1_H;
				CanTx.Data[5] = C1_L;
				CanTx.Data[6] = B2_H;
				CanTx.Data[7] = B2_L;
				HAL_CAN_Transmit(&hcan, 10);
				HAL_Delay(10);

				CanTx.StdId = 0x203;
				CanTx.DLC = 5;
				CanTx.Data[0] = D1_H;
				CanTx.Data[1] = D1_L;
				CanTx.Data[2] = E_HH;
				CanTx.Data[3] = E_H;
				CanTx.Data[4] = E_L;
				HAL_CAN_Transmit(&hcan, 10);
				HAL_Delay(10);

				CanTx.StdId = 0x204;
				CanTx.DLC = 4;
				CanTx.Data[0] = D2_H;
				CanTx.Data[1] = D2_L;
				CanTx.Data[2] = C2_H;
				CanTx.Data[3] = C2_L;
				HAL_CAN_Transmit(&hcan, 10);
				HAL_Delay(10);
			}
		}

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_I2C2|RCC_PERIPHCLK_TIM1;
  PeriphClkInit.I2c2ClockSelection = RCC_I2C2CLKSOURCE_HSI;
  PeriphClkInit.Tim1ClockSelection = RCC_TIM1CLK_HCLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* CAN init function */
static void MX_CAN_Init(void)
{

  hcan.Instance = CAN;
  hcan.Init.Prescaler = 400;
  hcan.Init.Mode = CAN_MODE_NORMAL;
  hcan.Init.SJW = CAN_SJW_1TQ;
  hcan.Init.BS1 = CAN_BS1_12TQ;
  hcan.Init.BS2 = CAN_BS2_5TQ;
  hcan.Init.TTCM = DISABLE;
  hcan.Init.ABOM = DISABLE;
  hcan.Init.AWUM = DISABLE;
  hcan.Init.NART = DISABLE;
  hcan.Init.RFLM = DISABLE;
  hcan.Init.TXFP = DISABLE;
  if (HAL_CAN_Init(&hcan) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

