thangtk21/STM32-Projects/Ignition Coil/Rev2/Get_Data/Receive_303rct6/Src/main.c
//---------------------------------------------------------------------------------------------------Can Receive Interrupt
void HAL_CAN_RxCpltCallback(CAN_HandleTypeDef* CanHandle)
{
  if (CanHandle->pRxMsg->StdId == 0x101)
  {
    can_rx_int1 = 1;
    n1_pa = CanHandle->pRxMsg->Data[0];
    n2_pa = CanHandle->pRxMsg->Data[1];
    B_H = CanHandle->pRxMsg->Data[2];
    B_L = CanHandle->pRxMsg->Data[3];
    C_H = CanHandle->pRxMsg->Data[4];
    C_L = CanHandle->pRxMsg->Data[5];
    D_H = CanHandle->pRxMsg->Data[6];
    D_L = CanHandle->pRxMsg->Data[7];
  }
  if (CanHandle->pRxMsg->StdId == 0x102)
  {
    can_rx_int2 = 1;
		n1_pb = CanHandle->pRxMsg->Data[0];
    n2_pb = CanHandle->pRxMsg->Data[1];
    B1_H = CanHandle->pRxMsg->Data[2];
    B1_L = CanHandle->pRxMsg->Data[3];
    C1_H = CanHandle->pRxMsg->Data[4];
    C1_L = CanHandle->pRxMsg->Data[5];
    B2_H = CanHandle->pRxMsg->Data[6];
    B2_L = CanHandle->pRxMsg->Data[7];
  }
  if (CanHandle->pRxMsg->StdId == 0x103)
  {
    can_rx_int3 = 1;
    D1_H = CanHandle->pRxMsg->Data[0];
    D1_L = CanHandle->pRxMsg->Data[1];
    E_HH = CanHandle->pRxMsg->Data[2];
    E_H = CanHandle->pRxMsg->Data[3];
    E_L = CanHandle->pRxMsg->Data[4];
  }
  if (CanHandle->pRxMsg->StdId == 0x104)
  {
    can_rx_int4 = 1;
    D2_H = CanHandle->pRxMsg->Data[0];
    D2_L = CanHandle->pRxMsg->Data[1];
    C2_H = CanHandle->pRxMsg->Data[2];
    C2_L = CanHandle->pRxMsg->Data[3];
  }
	if(CanHandle->pRxMsg->StdId == 0x10A)
	{
		flag_request_data = 1;
		flag_choose_mode = CanHandle->pRxMsg->Data[0];
	}
  RxIntEnable(&hcan);
}
//---------------------------------------------------------------------------------------------------External Interrupt
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if (GPIO_Pin == in1_rising_Pin)
  {
		HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
		
    flag_in1_rising_a_tim1 = 1;
    flag_in1_rising_b_tim1 = 1;
    flag_in1_rising_a_tim2 = 1;
    flag_in1_rising_b_tim2 = 1;
  }
  if (GPIO_Pin == in1_falling_Pin)
  {
    HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
		
    flag_in1_falling_a_tim1 = 1;
    flag_in1_falling_b_tim1 = 1;
    flag_in1_falling_a_tim2 = 1;
    flag_in1_falling_b_tim2 = 1;
  }
  if (GPIO_Pin == in2_rising_Pin)
  {
    HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
		
    flag_in2_rising_a_tim1 = 1;
    flag_in2_rising_b_tim1 = 1;
    flag_in2_rising_a_tim2 = 1;
    flag_in2_rising_b_tim2 = 1;
  }
  if (GPIO_Pin == in2_falling_Pin)
  {
		HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
		
    flag_in2_falling_a_tim1 = 1;
    flag_in2_falling_b_tim1 = 1;
    flag_in2_falling_a_tim2 = 1;
    flag_in2_falling_b_tim2 = 1;
  }
  if (GPIO_Pin == in3_rising_Pin)
  {
		HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
		
    flag_in3_rising_a_tim1 = 1;
    flag_in3_rising_b_tim1 = 1;
    flag_in3_rising_a_tim2 = 1;
    flag_in3_rising_b_tim2 = 1;
    
  }
  if (GPIO_Pin == in3_falling_Pin)
  {
		HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
		
    flag_in3_falling_a_tim1 = 1;
    flag_in3_falling_b_tim1 = 1;
    flag_in3_falling_a_tim2 = 1;
    flag_in3_falling_b_tim2 = 1;
    
  }
  if (GPIO_Pin == in4_rising_Pin)
  {
		HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
		
    flag_in4_rising_a_tim1 = 1;
    flag_in4_rising_b_tim1 = 1;
    flag_in4_rising_a_tim2 = 1;
    flag_in4_rising_b_tim2 = 1;
    
  }
  if (GPIO_Pin == in4_falling_Pin)
  {
		HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
		
		if(flag_choose_mode == pattern_a && D == 0)
			HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
		
    flag_in4_falling_a_tim1 = 1;
    flag_in4_falling_b_tim1 = 1;
    flag_in4_falling_a_tim2 = 1;
    flag_in4_falling_b_tim2 = 1;
    
  }
}
//---------------------------------------------------------------------------------------------------Timer Interrupt
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  //--------------------------------------------------------------------------Timer 1
  if (htim->Instance == TIM1)
  {
    //-----------------------------------------------------------channel 1
    //------------------------------------------output 1a
    if (flag_in1_falling_a_tim1 == 1)
    {
      if (counter_out1a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
      }
      if (counter_out1a_tim1 >= B / 10 && counter_out1a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
      }
      if (counter_out1a_tim1 == (B + C) / 10 || B == 0 || C == 0)
      {
        counter_out1a_tim1 = 0;
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
        n1_times_tim1_in1++;
      }
      counter_out1a_tim1++;
      if (n1_times_tim1_in1 == n1_pa||n1_pa == 0)
      {
        counter_out1a_tim1 = 0;
        n1_times_tim1_in1 = 0;
        flag_in1_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 1b //
    if (flag_in1_rising_b_tim1 == 1 && D!=0)
    {
      if (counter_out1b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
        counter_out1b_tim1_before = UINT16_MAX;
        flag_in1_rising_b_tim1 = 0;
      }
      counter_out1b_tim1_before++;
    }
    if (flag_in1_falling_b_tim1 == 1&& D!=0)
    {
      if (counter_out1b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim1_after >= D / 10 && counter_out1b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim1_after >= (D + B) / 10 && counter_out1b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim1_after == (D + B + C) / 10)
      {
        counter_out1b_tim1_after = D / 10;
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
        n2_times_tim1_in1++;
      }
      counter_out1b_tim1_after++;
      if ((n2_times_tim1_in1 == n2_pa && n2_pa > 0)||(n2_pa == 0 && counter_out1b_tim1_after == D/ 10))
      {
				HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
        counter_out1b_tim1_after = 0;
        n2_times_tim1_in1 = 0;
        flag_in1_falling_b_tim1 = 0;
      }
    }
    //-----------------------------------------------------------channel 2
    //------------------------------------------output 2a
    if (flag_in2_falling_a_tim1 == 1)
    {
      if (counter_out2a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
      }
      if (counter_out2a_tim1 >= B / 10 && counter_out2a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
      }
      if (counter_out2a_tim1 == (B + C) / 10|| B == 0 || C == 0)
      {
        counter_out2a_tim1 = 0;
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
        n1_times_tim1_in2++;
      }
      counter_out2a_tim1++;
      if (n1_times_tim1_in2 == n1_pa||n1_pa == 0)
      {
        counter_out2a_tim1 = 0;
        n1_times_tim1_in2 = 0;
        flag_in2_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 2b
    if (flag_in2_rising_b_tim1 == 1&& D!=0)
    {
      if (counter_out2b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
        counter_out2b_tim1_before = UINT16_MAX;
        flag_in2_rising_b_tim1 = 0;
      }
      counter_out2b_tim1_before++;
    }
    if (flag_in2_falling_b_tim1 == 1&& D!=0)
    {
      if (counter_out2b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim1_after >= D / 10 && counter_out2b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim1_after >= (D + B) / 10 && counter_out2b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim1_after == (D + B + C) / 10)
      {
       counter_out2b_tim1_after = D / 10;
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
        n2_times_tim1_in2++;
      }
      counter_out2b_tim1_after++;
      if ((n2_times_tim1_in2 == n2_pa && n2_pa > 0)||(n2_pa == 0 && counter_out2b_tim1_after == D/ 10))
      {
				HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
        counter_out2b_tim1_after = 0;
        n2_times_tim1_in2 = 0;
        flag_in2_falling_b_tim1 = 0;
      }
    }
    //-----------------------------------------------------------channel 3
    //------------------------------------------output 3a
    if (flag_in3_falling_a_tim1 == 1)
    {
      if (counter_out3a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
      }
      if (counter_out3a_tim1 >= B / 10 && counter_out3a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
      }
      if (counter_out3a_tim1 == (B + C) / 10|| B == 0 || C == 0)
      {
        counter_out3a_tim1 = 0;
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
        n1_times_tim1_in3++;
      }
      counter_out3a_tim1++;
      if (n1_times_tim1_in3 == n1_pa||n1_pa == 0)
      {
        counter_out3a_tim1 = 0;
        n1_times_tim1_in3 = 0;
        flag_in3_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 3b
    if (flag_in3_rising_b_tim1 == 1&& D!=0)
    {
      if (counter_out3b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
        counter_out3b_tim1_before = UINT16_MAX;
        flag_in3_rising_b_tim1 = 0;
      }
      counter_out3b_tim1_before++;
    }
    if (flag_in3_falling_b_tim1 == 1&& D!=0)
    {
      if (counter_out3b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim1_after >= D / 10 && counter_out3b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim1_after >= (D + B) / 10 && counter_out3b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim1_after == (D + B + C) / 10)
      {
        counter_out3b_tim1_after = D / 10;
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
        n2_times_tim1_in3++;
      }
      counter_out3b_tim1_after++;
      if ((n2_times_tim1_in3 == n2_pa && n2_pa > 0)||(n2_pa == 0 && counter_out3b_tim1_after == D/ 10))
      {
				HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
        counter_out3b_tim1_after = 0;
        n2_times_tim1_in3 = 0;
        flag_in3_falling_b_tim1 = 0;
      }
    }
    //-----------------------------------------------------------channel 4
    //------------------------------------------output 4a
    if (flag_in4_falling_a_tim1 == 1)
    {
      if (counter_out4a_tim1 < B / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
      }
      if (counter_out4a_tim1 >= B / 10 && counter_out4a_tim1 < (B + C) / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
      }
      if (counter_out4a_tim1 == (B + C) / 10|| B == 0 || C == 0)
      {
        counter_out4a_tim1 = 0;
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
        n1_times_tim1_in4++;
      }
      counter_out4a_tim1++;
      if (n1_times_tim1_in4 == n1_pa||n1_pa == 0)
      {
        counter_out4a_tim1 = 0;
        n1_times_tim1_in4 = 0;
        flag_in4_falling_a_tim1 = 0;
      }
    }
    //------------------------------------------output 4b
    if (flag_in4_rising_b_tim1 == 1&& D!=0)
    {
      if (counter_out4b_tim1_before < D / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim1_before == D / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
        counter_out4b_tim1_before = UINT16_MAX;
        flag_in4_rising_b_tim1 = 0;
      }
      counter_out4b_tim1_before++;
    }
    if (flag_in4_falling_b_tim1 == 1 && D!=0)
    {
      if (counter_out4b_tim1_after < D / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim1_after >= D / 10 && counter_out4b_tim1_after < (D + B) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim1_after >= (D + B) / 10 && counter_out4b_tim1_after < (D + B + C) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim1_after == (D + B + C) / 10)
      {
        counter_out4b_tim1_after = D / 10;
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
        n2_times_tim1_in4++;
      }
      counter_out4b_tim1_after++;
      if ((n2_times_tim1_in4 == n2_pa && n2_pa > 0)||(n2_pa == 0 && counter_out4b_tim1_after == D/ 10))
      {
				HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
        counter_out4b_tim1_after = 0;
        n2_times_tim1_in4 = 0;
        flag_in4_falling_b_tim1 = 0;
      }
    }
  }
  //--------------------------------------------------------------------------Timer 2 pattern b
  if (htim->Instance == TIM2)
  {
    //-----------------------------------------------------------output 1a
    if (flag_in1_falling_a_tim2 == 1)
    {
      if (counter_out1a_tim2 < B1 / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
      }
      if (counter_out1a_tim2 >= B1 / 10 && counter_out1a_tim2 < (B1 + C1) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
      }
      if (counter_out1a_tim2 >= (B1 + C1) / 10 && counter_out1a_tim2 < (B1 + C1 + B2) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
      }
      if (counter_out1a_tim2 >= (B1 + C1 + B2) / 10 && counter_out1a_tim2 < (B1 + C1 + B2 + C1) / 10)
      {
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 0);
      }
      if (counter_out1a_tim2 == (B1 + C1 + B2 + C1) / 10)
      {
        counter_out1a_tim2 = (B1 + C1) / 10;
        HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
        n1_times_tim2_in1++;
      }
      counter_out1a_tim2++;
      if ((n1_times_tim2_in1 == n1_pb - 1 && n1_pb >= 2)|| (n1_pb == 1 && counter_out1a_tim2 == (B1+C1)/ 10)|| n1_pb == 0)
      {
				HAL_GPIO_WritePin(out1a_GPIO_Port, out1a_Pin, 1);
        counter_out1a_tim2 = 0;
        n1_times_tim2_in1 = 0;
        flag_in1_falling_a_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 1b
    if (flag_in1_falling_b_tim2 == 1)
    {
      if (counter_out1b_tim2 < D1 / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim2 >= D1 / 10 && counter_out1b_tim2 < (D1 + E) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim2 >= (D1 + E) / 10 && counter_out1b_tim2 < (B1 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim2 >= (B1 + C1 + D2) / 10 && counter_out1b_tim2 < (B1 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim2 >= (B1 + C1 + D2 + C2) / 10 && counter_out1b_tim2 < (B1 + C1 + B2 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      if (counter_out1b_tim2 >= (B1 + C1 + B2 + C1 + D2) / 10 && counter_out1b_tim2 < (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 0);
      }
      if (counter_out1b_tim2 == (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        counter_out1b_tim2 = (B1 + C1 + D2 + C2) / 10;
        n2_times_tim2_in1++;
        HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
      }
      counter_out1b_tim2++;
      if ((n2_times_tim2_in1 == n2_pb - 1 && n2_pb >=2)|| (counter_out1b_tim2 == (B1+C1+D2+C2)/ 10 && n2_pb == 1 ) || (n2_pb == 0 && counter_out1b_tim2 == (D1+E)/ 10))
      {
				HAL_GPIO_WritePin(out1b_GPIO_Port, out1b_Pin, 1);
        counter_out1b_tim2 = 0;
        n2_times_tim2_in1 = 0;
        flag_in1_falling_b_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 2a
    if (flag_in2_falling_a_tim2 == 1)
    {
      if (counter_out2a_tim2 < B1 / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
      }
      if (counter_out2a_tim2 >= B1 / 10 && counter_out2a_tim2 < (B1 + C1) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
      }
      if (counter_out2a_tim2 >= (B1 + C1) / 10 && counter_out2a_tim2 < (B1 + C1 + B2) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
      }
      if (counter_out2a_tim2 >= (B1 + C1 + B2) / 10 && counter_out2a_tim2 < (B1 + C1 + B2 + C1) / 10)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 0);
      }
      if (counter_out2a_tim2 == (B1 + C1 + B2 + C1) / 10)
      {
        counter_out2a_tim2 = (B1 + C1) / 10;
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
        n1_times_tim2_in2++;
      }
      counter_out2a_tim2++;
      if ((n1_times_tim2_in2 == n1_pb - 1 && n1_pb >= 2)|| (n1_pb == 1 && counter_out2a_tim2 == (B1+C1)/ 10)|| n1_pb == 0)
      {
        HAL_GPIO_WritePin(out2a_GPIO_Port, out2a_Pin, 1);
				counter_out2a_tim2 = 0;
        n1_times_tim2_in2 = 0;
        flag_in2_falling_a_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 2b
    if (flag_in2_falling_b_tim2 == 1)
    {
      if (counter_out2b_tim2 < D1 / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim2 >= D1 / 10 && counter_out2b_tim2 < (D1 + E) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim2 >= (D1 + E) / 10 && counter_out2b_tim2 < (B1 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim2 >= (B1 + C1 + D2) / 10 && counter_out2b_tim2 < (B1 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim2 >= (B1 + C1 + D2 + C2) / 10 && counter_out2b_tim2 < (B1 + C1 + B2 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }
      if (counter_out2b_tim2 >= (B1 + C1 + B2 + C1 + D2) / 10 && counter_out2b_tim2 < (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 0);
      }
      if (counter_out2b_tim2 == (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        counter_out2b_tim2 = (B1 + C1 + D2 + C2) / 10;
        n2_times_tim2_in2++;
        HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
      }

