thangtk21/STM32-Projects/Ignition Coil/Rev2/Get_Data/Receive_303rct6/Src/main.c
      counter_out2b_tim2++;
      if ((n2_times_tim2_in2 == n2_pb - 1 && n2_pb >=2)|| (counter_out2b_tim2 == (B1+C1+D2+C2)/ 10 && n2_pb == 1)|| (n2_pb == 0 && counter_out2b_tim2 == (D1+E)/ 10))
      {
				HAL_GPIO_WritePin(out2b_GPIO_Port, out2b_Pin, 1);
        counter_out2b_tim2 = 0;
        n2_times_tim2_in2 = 0;
        flag_in2_falling_b_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 3a
    if (flag_in3_falling_a_tim2 == 1)
    {
      if (counter_out3a_tim2 < B1 / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
      }
      if (counter_out3a_tim2 >= B1 / 10 && counter_out3a_tim2 < (B1 + C1) / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
      }
      if (counter_out3a_tim2 >= (B1 + C1) / 10 && counter_out3a_tim2 < (B1 + C1 + B2) / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
      }
      if (counter_out3a_tim2 >= (B1 + C1 + B2) / 10 && counter_out3a_tim2 < (B1 + C1 + B2 + C1) / 10)
      {
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 0);
      }
      if (counter_out3a_tim2 == (B1 + C1 + B2 + C1) / 10)
      {
        counter_out3a_tim2 = (B1 + C1) / 10;
        HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
        n1_times_tim2_in3++;
      }
      counter_out3a_tim2++;
      if ((n1_times_tim2_in3 == n1_pb - 1 && n1_pb >= 2)|| (n1_pb == 1 && counter_out3a_tim2 == (B1+C1)/ 10) || n1_pb == 0)
      {
				HAL_GPIO_WritePin(out3a_GPIO_Port, out3a_Pin, 1);
        counter_out3a_tim2 = 0;
        n1_times_tim2_in3 = 0;
        flag_in3_falling_a_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 3b
    if (flag_in3_falling_b_tim2 == 1)
    {
      if (counter_out3b_tim2 < D1 / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim2 >= D1 / 10 && counter_out3b_tim2 < (D1 + E) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim2 >= (D1 + E) / 10 && counter_out3b_tim2 < (B1 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim2 >= (B1 + C1 + D2) / 10 && counter_out3b_tim2 < (B1 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim2 >= (B1 + C1 + D2 + C2) / 10 && counter_out3b_tim2 < (B1 + C1 + B2 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }
      if (counter_out3b_tim2 >= (B1 + C1 + B2 + C1 + D2) / 10 && counter_out3b_tim2 < (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 0);
      }
      if (counter_out3b_tim2 == (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        counter_out3b_tim2 = (B1 + C1 + D2 + C2) / 10;
        n2_times_tim2_in3++;
        HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
      }

      counter_out3b_tim2++;
      if ((n2_times_tim2_in3 == n2_pb - 1 && n2_pb >=2)|| (counter_out3b_tim2 == (B1+C1+D2+C2)/ 10 && n2_pb == 1) || (n2_pb == 0 && counter_out3b_tim2 == (D1+E)/ 10))
      {
				HAL_GPIO_WritePin(out3b_GPIO_Port, out3b_Pin, 1);
        counter_out3b_tim2 = 0;
        n2_times_tim2_in3 = 0;
        flag_in3_falling_b_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 4a
    if (flag_in4_falling_a_tim2 == 1)
    {
      if (counter_out4a_tim2 < B1 / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
      }
      if (counter_out4a_tim2 >= B1 / 10 && counter_out4a_tim2 < (B1 + C1) / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
      }
      if (counter_out4a_tim2 >= (B1 + C1) / 10 && counter_out4a_tim2 < (B1 + C1 + B2) / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
      }
      if (counter_out4a_tim2 >= (B1 + C1 + B2) / 10 && counter_out4a_tim2 < (B1 + C1 + B2 + C1) / 10)
      {
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 0);
      }
      if (counter_out4a_tim2 == (B1 + C1 + B2 + C1) / 10)
      {
        counter_out4a_tim2 = (B1 + C1) / 10;
        HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
        n1_times_tim2_in4++;
      }
      counter_out4a_tim2++;
       if ((n1_times_tim2_in4 == n1_pb - 1 && n1_pb >= 2)|| (n1_pb == 1 && counter_out4a_tim2 == (B1+C1)/ 10) || n1_pb == 0)
      {
				HAL_GPIO_WritePin(out4a_GPIO_Port, out4a_Pin, 1);
        counter_out4a_tim2 = 0;
        n1_times_tim2_in4 = 0;
        flag_in4_falling_a_tim2 = 0;
      }
    }
    //-----------------------------------------------------------output 4b
    if (flag_in4_falling_b_tim2 == 1)
    {
      if (counter_out4b_tim2 < D1 / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim2 >= D1 / 10 && counter_out4b_tim2 < (D1 + E) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim2 >= (D1 + E) / 10 && counter_out4b_tim2 < (B1 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim2 >= (B1 + C1 + D2) / 10 && counter_out4b_tim2 < (B1 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim2 >= (B1 + C1 + D2 + C2) / 10 && counter_out4b_tim2 < (B1 + C1 + B2 + C1 + D2) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      if (counter_out4b_tim2 >= (B1 + C1 + B2 + C1 + D2) / 10 && counter_out4b_tim2 < (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 0);
      }
      if (counter_out4b_tim2 == (B1 + C1 + B2 + C1 + D2 + C2) / 10)
      {
       counter_out4b_tim2 = (B1 + C1 + D2 + C2) / 10;
        n2_times_tim2_in4++;
        HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
      }
      counter_out4b_tim2++;
      if ((n2_times_tim2_in4 == n2_pb - 1 && n2_pb >=2)|| (counter_out4b_tim2 == (B1+C1+D2+C2)/ 10 && n2_pb == 1) || (n2_pb == 0 && counter_out4b_tim2 == (D1+E)/ 10) )
      {
				HAL_GPIO_WritePin(out4b_GPIO_Port, out4b_Pin, 1);
        counter_out4b_tim2 = 0;
        n2_times_tim2_in4 = 0;
        flag_in4_falling_b_tim2 = 0;
      }
    }
  }
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  file: The file name as string.
  * @param  line: The line in file as a number.
  * @retval None
  */
void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
